"""
Модуль коментарів для створення ієрархічної структури коментарів із відповідями.

Цей модуль містить клас `Comment`, який представляє окремий коментар у системі коментарів.
Коментарі можуть мати вкладені відповіді, що дозволяє створити багаторівневу структуру.
Клас `Comment` підтримує додавання відповідей, видалення коментарів з позначкою про видалення,
а також рекурсивне виведення структури коментарів з відступами для кожного рівня вкладеності.
"""

from typing import List

class Comment:
    """
    Клас, що представляє коментар із можливістю додавання відповідей, видалення
    із позначкою про видалення, а також рекурсивного виведення коментарів із
    відповідями у вигляді ієрархії.

    Атрибути:
        text (str): Текст коментаря.
        author (str): Ім'я автора коментаря.
        replies (List[Comment]): Список відповідей на коментар.
        is_deleted (bool): Позначка, чи видалено коментар.
    """

    def __init__(self, text: str, author: str) -> None:
        """
        Ініціалізує новий коментар.

        Args:
            text (str): Текст коментаря.
            author (str): Ім'я автора коментаря.
        """
        self.text: str = text
        self.author: str = author
        self.replies: List[Comment] = []
        self.is_deleted: bool = False

    def add_reply(self, reply: 'Comment') -> None:
        """
        Додає нову відповідь до поточного коментаря.

        Args:
            reply (Comment): Коментар, що є відповіддю на поточний коментар.
        """
        self.replies.append(reply)

    def remove_reply(self) -> None:
        """
        Позначає поточний коментар як видалений.
        Змінює текст коментаря на "Цей коментар було видалено." та
        встановлює позначку `is_deleted` в `True`.
        """
        self.text = "Цей коментар було видалено."
        self.is_deleted = True

    def display(self, level: int = 0) -> None:
        """
        Рекурсивно виводить коментар та всі його відповіді з відступами.

        Args:
            level (int): Рівень вкладеності для форматування відступів.
        """
        indent = "    " * level
        if self.is_deleted:
            print(f"{indent}\033[90m{self.text}\033[0m")
        else:
            print(f"{indent}\033[94m{self.author}:\033[0m {self.text}")
        for reply in self.replies:
            reply.display(level + 1)
