"""
Модуль для генерації випадкових чисел із заданих параметрів.

Цей модуль містить функцію `generate_random_keys`, яка використовується для генерації списку випадкових
цілих чисел у заданому діапазоні.
"""

import random
from typing import List

def generate_random_keys(num_keys: int, min_value: int, max_value: int) -> List[int]:
    """
    Генерує список унікальних випадкових цілих чисел у заданому діапазоні.

    Параметри:
    - num_keys (int): кількість випадкових чисел, які потрібно згенерувати.
    - min_value (int): мінімальне значення для випадкового числа.
    - max_value (int): максимальне значення для випадкового числа.

    Повертає:
    - List[int]: список унікальних випадкових чисел.

    Викликає ValueError, якщо `num_keys` більше, ніж кількість унікальних чисел у вказаному діапазоні.
    """
    return random.sample(range(min_value, max_value + 1), num_keys)
