"""
Модуль для реалізації класу вузла двійкового дерева пошуку (AVL-дерева).
Клас `Node` представляє окремий вузол дерева з ключем, лівим і правим нащадками, а також висотою.
"""

class Node:
    """
    Клас `Node` представляє окремий вузол двійкового дерева з ключем, 
    лівим і правим нащадками, а також висотою вузла для підтримки балансування в AVL-дереві.
    
    Атрибути:
    ----------
    key : int
        Ключове значення вузла.
    left : Node or None
        Лівий нащадок вузла, або None, якщо відсутній.
    right : Node or None
        Правий нащадок вузла, або None, якщо відсутній.
    height : int
        Висота вузла для балансування AVL-дерева.
    """

    def __init__(self, key: int):
        """
        Ініціалізація нового вузла дерева з ключем і висотою, рівною 1.
        
        Параметри:
        ----------
        key : int
            Значення ключа для нового вузла.
        """
        self.key: int = key
        self.left: 'Node' | None = None
        self.right: 'Node' | None = None
        self.height: int = 1
